{
  "101" : {
    "msg" : "Dossier radié. Le document ne peut être édité.",
    "code": 400
  },
  "102": {
    "msg" : "Dossier radié au cours de la période de référence. Le document ne peut être édité.",
    "code": 400
  },
  "103": {
    "msg": "L’opérateurs téléphonique» ne propose pas de raccordement SMS avec un prestataire externe (raccordement avec un numéro court). ",
    "code": 400
  },
  "111": {
    "msg": "Dossier en cours d'affiliation sur la période de référence. Le document ne peut être édité.",
    "code": 400
  },
  "121": {
    "msg": "Dossier suspendu. Le document ne peut être édité.",
    "code": 400
  },
  "122": {
    "msg": "Dossier suspendu au cours de la période de référence. Le document ne peut être édité.",
    "code": 400
  },
  "131": {
    "msg": "Absence du nom du responsable dossier. Le document ne peut être édité.",
    "code": 400
  },
  "132": {
    "msg": "Décès MON/MME. Le document ne peut être édité.",
    "code": 400
  },
  "133": {
    "msg": "Dossier allocataire inexistant. Le document ne peut être édité.",
    "code": 400
  },
  "141": {
    "msg": "Non droit. Le document ne peut être édité.",
    "code": 400
  },
  "151": {
    "msg": "Votre quotient familial (Qf) sur cette période est non disponible. Pour plus d'information, contactez-nous.",
    "code": 400
  },
  "161": {
    "msg": "Absence ressources ou QF à 0 sur la période de référence. Le document ne peut être édité.",
    "code": 400
  },
  "171": {
    "msg": "Le dossier n'est pas éligible à la réduction sociale téléphonique - Pas de droit AAH ou RSA à la date de situation.",
    "code": 400
  },
  "181": {
    "msg": "Absence de code confidentiel. Le document ne peut être édité.",
    "code": 400
  },
  "191": {
    "msg": "Pas de droit sur la période demandée pour la prestation sélectionnée (entre début période et date du jour)",
    "code": 400
  },
  "192": {
    "msg": "Il existe des droits pour la prestation sélectionnée sur le dossier et/ou la période demandée",
    "code": 400
  },
  "193": {
    "msg": "Il existe des droits pour la prestation sélectionnée sur le dossier et/ou la période demandée (après date du jour)",
    "code": 400
  },
  "194": {
    "msg": "Pas de droit sur la période demandée pour la prestation sélectionnée (entre début période et fin période)",
    "code": 400
  },
  "195": {
    "msg": "Allocataire non radié à la date de situation demandée",
    "code": 400
  },
  "196": {
    "msg": "Il existe au moins un enfant pour lequel il existe un droit sur le dossier et/ou après la date de situation demandée",
    "code": 400
  },
  "197": {
    "msg": "Il existe au moins un enfant pour lequel il existe un droit sur le dossier et/ou à la période demandée",
    "code": 400
  },
  "198": {
    "msg": "Il existe au moins un enfant pour lequel il existe ou il a existé un droit sur le dossier",
    "code": 400
  },
  "1113": {
    "msg":"Pas de droit sur la période demandée pour la prestation sélectionnée.",
    "code": 400
  },
  "1114": {
    "msg": "Pas de droit sur la période demandée pour la prestation sélectionnée et le bénéficiaire choisi",
    "code": 400
  },
  "201": {
    "msg": "Les informations souhaitées sont momentanément indisponibles. Merci de renouveler votre demande ultérieurement.",
    "code": 500
  },
  "211": {
    "msg": "Votre demande n’a pu aboutir en raison d'un problème technique lié aux données entrantes du webservice. Merci de renouveler votre demande ultérieurement.",
    "code":500
  },
  "221": {
    "msg": "Votre demande n'a pu aboutir en raison d'un incident technique momentané. Merci de renouveler votre demande ultérieurement.",
    "code": 500
  },
  "231": {
    "msg": "Problème technique avec le service trafic",
    "code": 500
  },
  "241": {
    "msg": "Problème technique avec le service tiersi",
    "code": 500
  },
  "251": {
    "msg": "Votre demande n'a pu aboutir car le numéro de téléphone mentionné ne fait pas partie de la liste des numéros autorisés.",
    "code": 500
  },
  "252": {
    "msg": "Votre demande n'a pu aboutir en raison d'un incident technique lié à l'appel au service IMC. Le SMS a été envoyé mais l'acquittement n'a pas été reçu.",
    "code": 500
  },
  "253": {
    "msg": "Votre demande n'a pu aboutir en raison d'un incident technique lié à l'appel au service IMC. Des paramètres manquent.",
    "code": 500
  },
  "254": {
    "msg:": "Votre demande n'a pu aboutir en raison d'un incident technique lié à l'appel au service IMC. La date de fin doit être antérieure à la date de début.",
    "code": 500
  },
  "255": {
    "msg": "Votre demande n'a pu aboutir en raison d'un incident technique lié à l'appel au service IMC. La taille du message ne doit pas être supérieure à 160 caractères.",
    "code": 500
  },
  "256": {
    "msg": "Votre demande n'a pu aboutir en raison d'une erreur technique lié à l'appel au service IMC.",
    "code": 500
  },
  "257": {
    "msg": "Votre demande n'a pu aboutir en raison d'une erreur fonctionnelle lié à l'appel au service IMC.",
    "code": 500
  }

}
